experiments/socialnetwork_4node/expected_results/qps10000/wrk.log
Running 2m test @ http://ip-172-31-8-223.us-east-2.compute.internal:8080
  4 threads and 96 connections
  Thread calibration: mean lat.: 3.404ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.389ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.438ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.407ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.54ms    2.09ms 215.04ms   74.46%
    Req/Sec     2.61k   256.76     3.91k    69.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.65ms
 75.000%    5.36ms
 90.000%    6.58ms
 99.000%    8.53ms
 99.900%   12.32ms
 99.990%   18.33ms
 99.999%  137.09ms
100.000%  215.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.764     0.000000            1         1.00
       1.708     0.100000       140139         1.11
       1.970     0.200000       280116         1.25
       2.187     0.300000       420073         1.43
       2.403     0.400000       559684         1.67
       2.649     0.500000       699944         2.00
       2.799     0.550000       769728         2.22
       2.989     0.600000       839384         2.50
       3.281     0.650000       909416         2.86
       4.463     0.700000       979259         3.33
       5.363     0.750000      1049525         4.00
       5.587     0.775000      1084222         4.44
       5.787     0.800000      1119034         5.00
       5.979     0.825000      1154446         5.71
       6.167     0.850000      1189051         6.67
       6.367     0.875000      1224397         8.00
       6.471     0.887500      1241637         8.89
       6.583     0.900000      1259023        10.00
       6.703     0.912500      1276541        11.43
       6.839     0.925000      1294342        13.33
       6.991     0.937500      1311620        16.00
       7.079     0.943750      1320467        17.78
       7.175     0.950000      1329026        20.00
       7.283     0.956250      1337821        22.86
       7.403     0.962500      1346415        26.67
       7.547     0.968750      1355105        32.00
       7.631     0.971875      1359649        35.56
       7.719     0.975000      1363869        40.00
       7.827     0.978125      1368229        45.71
       7.951     0.981250      1372632        53.33
       8.107     0.984375      1377007        64.00
       8.199     0.985938      1379164        71.11
       8.311     0.987500      1381414        80.00
       8.439     0.989062      1383623        91.43
       8.583     0.990625      1385727       106.67
       8.767     0.992188      1387905       128.00
       8.887     0.992969      1389018       142.22
       9.023     0.993750      1390105       160.00
       9.175     0.994531      1391150       182.86
       9.375     0.995313      1392242       213.33
       9.639     0.996094      1393340       256.00
       9.807     0.996484      1393882       284.44
      10.015     0.996875      1394438       320.00
      10.247     0.997266      1394982       365.71
      10.519     0.997656      1395519       426.67
      10.871     0.998047      1396061       512.00
      11.087     0.998242      1396335       568.89
      11.343     0.998437      1396615       640.00
      11.631     0.998633      1396885       731.43
      11.959     0.998828      1397152       853.33
      12.375     0.999023      1397426      1024.00
      12.639     0.999121      1397568      1137.78
      12.919     0.999219      1397701      1280.00
      13.191     0.999316      1397836      1462.86
      13.503     0.999414      1397975      1706.67
      13.983     0.999512      1398109      2048.00
      14.183     0.999561      1398177      2275.56
      14.495     0.999609      1398245      2560.00
      14.863     0.999658      1398314      2925.71
      15.287     0.999707      1398382      3413.33
      15.727     0.999756      1398450      4096.00
      15.975     0.999780      1398485      4551.11
      16.263     0.999805      1398519      5120.00
      16.527     0.999829      1398553      5851.43
      17.071     0.999854      1398587      6826.67
      17.599     0.999878      1398621      8192.00
      17.887     0.999890      1398638      9102.22
      18.399     0.999902      1398655     10240.00
      18.847     0.999915      1398673     11702.86
      19.503     0.999927      1398689     13653.33
      21.231     0.999939      1398707     16384.00
      21.871     0.999945      1398715     18204.44
      22.591     0.999951      1398723     20480.00
      25.071     0.999957      1398732     23405.71
      25.759     0.999963      1398740     27306.67
      26.799     0.999969      1398749     32768.00
      27.519     0.999973      1398753     36408.89
      29.279     0.999976      1398757     40960.00
      37.471     0.999979      1398762     46811.43
      62.111     0.999982      1398766     54613.33
      86.975     0.999985      1398770     65536.00
     102.079     0.999986      1398772     72817.78
     117.439     0.999988      1398774     81920.00
     137.087     0.999989      1398777     93622.86
     152.959     0.999991      1398779    109226.67
     163.199     0.999992      1398781    131072.00
     167.295     0.999993      1398782    145635.56
     172.159     0.999994      1398783    163840.00
     180.223     0.999995      1398784    187245.71
     183.807     0.999995      1398785    218453.33
     191.871     0.999996      1398786    262144.00
     195.455     0.999997      1398787    291271.11
     195.455     0.999997      1398787    327680.00
     203.135     0.999997      1398788    374491.43
     203.135     0.999998      1398788    436906.67
     209.919     0.999998      1398789    524288.00
     209.919     0.999998      1398789    582542.22
     209.919     0.999998      1398789    655360.00
     212.607     0.999999      1398790    748982.86
     212.607     0.999999      1398790    873813.33
     212.607     0.999999      1398790   1048576.00
     212.607     0.999999      1398790   1165084.44
     212.607     0.999999      1398790   1310720.00
     215.167     0.999999      1398791   1497965.71
     215.167     1.000000      1398791          inf
#[Mean    =        3.540, StdDeviation   =        2.092]
#[Max     =      215.040, Total count    =      1398791]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.88ms
 75.000%    4.75ms
 90.000%    5.80ms
 99.000%    7.62ms
 99.900%   11.16ms
 99.990%   16.17ms
 99.999%   25.65ms
100.000%  214.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.626     0.000000            1         1.00
       1.203     0.100000       139893         1.11
       1.383     0.200000       280226         1.25
       1.555     0.300000       420480         1.43
       1.710     0.400000       559964         1.67
       1.882     0.500000       699426         2.00
       1.992     0.550000       769338         2.22
       2.141     0.600000       839977         2.50
       2.383     0.650000       909578         2.86
       3.865     0.700000       979161         3.33
       4.747     0.750000      1049300         4.00
       4.931     0.775000      1084355         4.44
       5.103     0.800000      1119379         5.00
       5.271     0.825000      1154613         5.71
       5.435     0.850000      1189062         6.67
       5.611     0.875000      1224459         8.00
       5.703     0.887500      1241688         8.89
       5.803     0.900000      1259252        10.00
       5.911     0.912500      1276575        11.43
       6.035     0.925000      1293994        13.33
       6.179     0.937500      1311505        16.00
       6.259     0.943750      1320166        17.78
       6.351     0.950000      1329194        20.00
       6.451     0.956250      1337885        22.86
       6.563     0.962500      1346445        26.67
       6.695     0.968750      1355167        32.00
       6.775     0.971875      1359576        35.56
       6.859     0.975000      1363838        40.00
       6.959     0.978125      1368199        45.71
       7.083     0.981250      1372607        53.33
       7.231     0.984375      1376950        64.00
       7.319     0.985938      1379129        71.11
       7.423     0.987500      1381325        80.00
       7.543     0.989062      1383569        91.43
       7.687     0.990625      1385723       106.67
       7.859     0.992188      1387882       128.00
       7.967     0.992969      1388956       142.22
       8.095     0.993750      1390067       160.00
       8.255     0.994531      1391174       182.86
       8.447     0.995313      1392248       213.33
       8.695     0.996094      1393358       256.00
       8.831     0.996484      1393880       284.44
       9.031     0.996875      1394433       320.00
       9.247     0.997266      1394979       365.71
       9.511     0.997656      1395526       426.67
       9.823     0.998047      1396061       512.00
      10.039     0.998242      1396340       568.89
      10.271     0.998437      1396614       640.00
      10.519     0.998633      1396881       731.43
      10.831     0.998828      1397155       853.33
      11.207     0.999023      1397428      1024.00
      11.447     0.999121      1397565      1137.78
      11.687     0.999219      1397702      1280.00
      11.967     0.999316      1397837      1462.86
      12.343     0.999414      1397973      1706.67
      12.679     0.999512      1398110      2048.00
      12.887     0.999561      1398177      2275.56
      13.151     0.999609      1398246      2560.00
      13.495     0.999658      1398314      2925.71
      13.847     0.999707      1398382      3413.33
      14.271     0.999756      1398450      4096.00
      14.511     0.999780      1398484      4551.11
      14.743     0.999805      1398520      5120.00
      14.983     0.999829      1398552      5851.43
      15.319     0.999854      1398587      6826.67
      15.695     0.999878      1398621      8192.00
      15.863     0.999890      1398639      9102.22
      16.239     0.999902      1398655     10240.00
      16.495     0.999915      1398672     11702.86
      16.911     0.999927      1398689     13653.33
      17.295     0.999939      1398707     16384.00
      17.775     0.999945      1398715     18204.44
      18.031     0.999951      1398723     20480.00
      18.575     0.999957      1398732     23405.71
      19.071     0.999963      1398740     27306.67
      20.847     0.999969      1398749     32768.00
      21.279     0.999973      1398753     36408.89
      22.479     0.999976      1398757     40960.00
      24.111     0.999979      1398762     46811.43
      24.463     0.999982      1398766     54613.33
      24.863     0.999985      1398770     65536.00
      24.895     0.999986      1398772     72817.78
      25.295     0.999988      1398775     81920.00
      25.647     0.999989      1398777     93622.86
      25.935     0.999991      1398779    109226.67
      25.999     0.999992      1398781    131072.00
      26.127     0.999993      1398782    145635.56
      26.399     0.999994      1398783    163840.00
      26.751     0.999995      1398784    187245.71
      27.903     0.999995      1398785    218453.33
      28.255     0.999996      1398786    262144.00
      28.687     0.999997      1398787    291271.11
      28.687     0.999997      1398787    327680.00
      28.847     0.999997      1398788    374491.43
      28.847     0.999998      1398788    436906.67
      29.423     0.999998      1398789    524288.00
      29.423     0.999998      1398789    582542.22
      29.423     0.999998      1398789    655360.00
      29.935     0.999999      1398790    748982.86
      29.935     0.999999      1398790    873813.33
      29.935     0.999999      1398790   1048576.00
      29.935     0.999999      1398790   1165084.44
      29.935     0.999999      1398790   1310720.00
     214.015     0.999999      1398791   1497965.71
     214.015     1.000000      1398791          inf
#[Mean    =        2.854, StdDeviation   =        1.928]
#[Max     =      213.888, Total count    =      1398791]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1499421 requests in 2.50m, 591.17MB read
Requests/sec:   9996.18
Transfer/sec:      3.94MB